NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* TASKS_START @Bit 0 : Start comparator */
  #define COMP_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define COMP_TASKS_START_TASKS_START_Msk (0x1UL << COMP_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define COMP_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define COMP_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define COMP_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* COMP_TASKS_STOP: Stop comparator */
  #define COMP_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop comparator */
  #define COMP_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define COMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << COMP_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define COMP_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define COMP_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define COMP_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* COMP_TASKS_SAMPLE: Sample comparator value. This task requires that COMP has been started by the START Task. */
  #define COMP_TASKS_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SAMPLE register.                               */

/* TASKS_SAMPLE @Bit 0 : Sample comparator value. This task requires that COMP has been started by the START Task. */
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL)   /*!< Position of TASKS_SAMPLE field.                                      */
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos) /*!< Bit mask of TASKS_SAMPLE field.*/
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Min (0x1UL) /*!< Min enumerator value of TASKS_SAMPLE field.                          */
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Max (0x1UL) /*!< Max enumerator value of TASKS_SAMPLE field.                          */
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (0x1UL) /*!< Trigger task                                                     */


/* COMP_SUBSCRIBE_START: Subscribe configuration for task START */
  #define COMP_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define COMP_SUBSCRIBE_START_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define COMP_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define COMP_SUBSCRIBE_START_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define COMP_SUBSCRIBE_START_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_START_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define COMP_SUBSCRIBE_START_EN_Msk (0x1UL << COMP_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                        */
  #define COMP_SUBSCRIBE_START_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_START_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_START_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define COMP_SUBSCRIBE_START_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* COMP_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define COMP_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define COMP_SUBSCRIBE_STOP_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define COMP_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define COMP_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define COMP_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_STOP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define COMP_SUBSCRIBE_STOP_EN_Msk (0x1UL << COMP_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define COMP_SUBSCRIBE_STOP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_STOP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_STOP_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define COMP_SUBSCRIBE_STOP_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* COMP_SUBSCRIBE_SAMPLE: Subscribe configuration for task SAMPLE */
  #define COMP_SUBSCRIBE_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SAMPLE register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task SAMPLE will subscribe to */
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Msk (0x1UL << COMP_SUBSCRIBE_SAMPLE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* COMP_EVENTS_READY: COMP is ready and output is valid */
  #define COMP_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                               */

/* EVENTS_READY @Bit 0 : COMP is ready and output is valid */
  #define COMP_EVENTS_READY_EVENTS_READY_Pos (0UL)   /*!< Position of EVENTS_READY field.                                      */
  #define COMP_EVENTS_READY_EVENTS_READY_Msk (0x1UL << COMP_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.*/
  #define COMP_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                          */
  #define COMP_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                          */
  #define COMP_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define COMP_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                */


/* COMP_EVENTS_DOWN: Downward crossing */
  #define COMP_EVENTS_DOWN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DOWN register.                                 */

/* EVENTS_DOWN @Bit 0 : Downward crossing */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Pos (0UL)     /*!< Position of EVENTS_DOWN field.                                       */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Msk (0x1UL << COMP_EVENTS_DOWN_EVENTS_DOWN_Pos) /*!< Bit mask of EVENTS_DOWN field.     */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Min (0x0UL)   /*!< Min enumerator value of EVENTS_DOWN field.                           */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Max (0x1UL)   /*!< Max enumerator value of EVENTS_DOWN field.                           */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Generated (0x1UL) /*!< Event generated                                                  */


/* COMP_EVENTS_UP: Upward crossing */
  #define COMP_EVENTS_UP_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_UP register.                                   */

/* EVENTS_UP @Bit 0 : Upward crossing */
  #define COMP_EVENTS_UP_EVENTS_UP_Pos (0UL)         /*!< Position of EVENTS_UP field.                                         */
  #define COMP_EVENTS_UP_EVENTS_UP_Msk (0x1UL << COMP_EVENTS_UP_EVENTS_UP_Pos) /*!< Bit mask of EVENTS_UP field.               */
  #define COMP_EVENTS_UP_EVENTS_UP_Min (0x0UL)       /*!< Min enumerator value of EVENTS_UP field.                             */
  #define COMP_EVENTS_UP_EVENTS_UP_Max (0x1UL)       /*!< Max enumerator value of EVENTS_UP field.                             */
  #define COMP_EVENTS_UP_EVENTS_UP_NotGenerated (0x0UL) /*!< Event not generated                                               */
  #define COMP_EVENTS_UP_EVENTS_UP_Generated (0x1UL) /*!< Event generated                                                      */


