NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* CH10 @Bit 10 : Channel 10 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH10_Pos (10UL)              /*!< Position of CH10 field.                                              */
  #define DPPIC_CHENCLR_CH10_Msk (0x1UL << DPPIC_CHENCLR_CH10_Pos) /*!< Bit mask of CH10 field.                                */
  #define DPPIC_CHENCLR_CH10_Min (0x0UL)             /*!< Min enumerator value of CH10 field.                                  */
  #define DPPIC_CHENCLR_CH10_Max (0x1UL)             /*!< Max enumerator value of CH10 field.                                  */
  #define DPPIC_CHENCLR_CH10_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH10_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH10_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH11 @Bit 11 : Channel 11 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH11_Pos (11UL)              /*!< Position of CH11 field.                                              */
  #define DPPIC_CHENCLR_CH11_Msk (0x1UL << DPPIC_CHENCLR_CH11_Pos) /*!< Bit mask of CH11 field.                                */
  #define DPPIC_CHENCLR_CH11_Min (0x0UL)             /*!< Min enumerator value of CH11 field.                                  */
  #define DPPIC_CHENCLR_CH11_Max (0x1UL)             /*!< Max enumerator value of CH11 field.                                  */
  #define DPPIC_CHENCLR_CH11_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH11_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH11_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH12 @Bit 12 : Channel 12 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH12_Pos (12UL)              /*!< Position of CH12 field.                                              */
  #define DPPIC_CHENCLR_CH12_Msk (0x1UL << DPPIC_CHENCLR_CH12_Pos) /*!< Bit mask of CH12 field.                                */
  #define DPPIC_CHENCLR_CH12_Min (0x0UL)             /*!< Min enumerator value of CH12 field.                                  */
  #define DPPIC_CHENCLR_CH12_Max (0x1UL)             /*!< Max enumerator value of CH12 field.                                  */
  #define DPPIC_CHENCLR_CH12_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH12_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH12_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH13 @Bit 13 : Channel 13 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH13_Pos (13UL)              /*!< Position of CH13 field.                                              */
  #define DPPIC_CHENCLR_CH13_Msk (0x1UL << DPPIC_CHENCLR_CH13_Pos) /*!< Bit mask of CH13 field.                                */
  #define DPPIC_CHENCLR_CH13_Min (0x0UL)             /*!< Min enumerator value of CH13 field.                                  */
  #define DPPIC_CHENCLR_CH13_Max (0x1UL)             /*!< Max enumerator value of CH13 field.                                  */
  #define DPPIC_CHENCLR_CH13_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH13_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH13_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH14 @Bit 14 : Channel 14 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH14_Pos (14UL)              /*!< Position of CH14 field.                                              */
  #define DPPIC_CHENCLR_CH14_Msk (0x1UL << DPPIC_CHENCLR_CH14_Pos) /*!< Bit mask of CH14 field.                                */
  #define DPPIC_CHENCLR_CH14_Min (0x0UL)             /*!< Min enumerator value of CH14 field.                                  */
  #define DPPIC_CHENCLR_CH14_Max (0x1UL)             /*!< Max enumerator value of CH14 field.                                  */
  #define DPPIC_CHENCLR_CH14_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH14_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH14_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH15 @Bit 15 : Channel 15 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH15_Pos (15UL)              /*!< Position of CH15 field.                                              */
  #define DPPIC_CHENCLR_CH15_Msk (0x1UL << DPPIC_CHENCLR_CH15_Pos) /*!< Bit mask of CH15 field.                                */
  #define DPPIC_CHENCLR_CH15_Min (0x0UL)             /*!< Min enumerator value of CH15 field.                                  */
  #define DPPIC_CHENCLR_CH15_Max (0x1UL)             /*!< Max enumerator value of CH15 field.                                  */
  #define DPPIC_CHENCLR_CH15_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH15_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH15_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH16 @Bit 16 : Channel 16 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH16_Pos (16UL)              /*!< Position of CH16 field.                                              */
  #define DPPIC_CHENCLR_CH16_Msk (0x1UL << DPPIC_CHENCLR_CH16_Pos) /*!< Bit mask of CH16 field.                                */
  #define DPPIC_CHENCLR_CH16_Min (0x0UL)             /*!< Min enumerator value of CH16 field.                                  */
  #define DPPIC_CHENCLR_CH16_Max (0x1UL)             /*!< Max enumerator value of CH16 field.                                  */
  #define DPPIC_CHENCLR_CH16_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH16_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH16_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH17 @Bit 17 : Channel 17 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH17_Pos (17UL)              /*!< Position of CH17 field.                                              */
  #define DPPIC_CHENCLR_CH17_Msk (0x1UL << DPPIC_CHENCLR_CH17_Pos) /*!< Bit mask of CH17 field.                                */
  #define DPPIC_CHENCLR_CH17_Min (0x0UL)             /*!< Min enumerator value of CH17 field.                                  */
  #define DPPIC_CHENCLR_CH17_Max (0x1UL)             /*!< Max enumerator value of CH17 field.                                  */
  #define DPPIC_CHENCLR_CH17_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH17_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH17_Clear (0x1UL)           /*!< Write: Disable channel                                               */

