NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_IN_PIN26_Pos (26UL)                   /*!< Position of PIN26 field.                                             */
  #define GPIO_IN_PIN26_Msk (0x1UL << GPIO_IN_PIN26_Pos) /*!< Bit mask of PIN26 field.                                         */
  #define GPIO_IN_PIN26_Min (0x0UL)                  /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_IN_PIN26_Max (0x1UL)                  /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_IN_PIN26_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN26_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_IN_PIN27_Pos (27UL)                   /*!< Position of PIN27 field.                                             */
  #define GPIO_IN_PIN27_Msk (0x1UL << GPIO_IN_PIN27_Pos) /*!< Bit mask of PIN27 field.                                         */
  #define GPIO_IN_PIN27_Min (0x0UL)                  /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_IN_PIN27_Max (0x1UL)                  /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_IN_PIN27_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN27_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_IN_PIN28_Pos (28UL)                   /*!< Position of PIN28 field.                                             */
  #define GPIO_IN_PIN28_Msk (0x1UL << GPIO_IN_PIN28_Pos) /*!< Bit mask of PIN28 field.                                         */
  #define GPIO_IN_PIN28_Min (0x0UL)                  /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_IN_PIN28_Max (0x1UL)                  /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_IN_PIN28_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN28_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_IN_PIN29_Pos (29UL)                   /*!< Position of PIN29 field.                                             */
  #define GPIO_IN_PIN29_Msk (0x1UL << GPIO_IN_PIN29_Pos) /*!< Bit mask of PIN29 field.                                         */
  #define GPIO_IN_PIN29_Min (0x0UL)                  /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_IN_PIN29_Max (0x1UL)                  /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_IN_PIN29_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN29_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_IN_PIN30_Pos (30UL)                   /*!< Position of PIN30 field.                                             */
  #define GPIO_IN_PIN30_Msk (0x1UL << GPIO_IN_PIN30_Pos) /*!< Bit mask of PIN30 field.                                         */
  #define GPIO_IN_PIN30_Min (0x0UL)                  /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_IN_PIN30_Max (0x1UL)                  /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_IN_PIN30_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN30_High (0x1UL)                 /*!< Pin input is high                                                    */

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_IN_PIN31_Pos (31UL)                   /*!< Position of PIN31 field.                                             */
  #define GPIO_IN_PIN31_Msk (0x1UL << GPIO_IN_PIN31_Pos) /*!< Bit mask of PIN31 field.                                         */
  #define GPIO_IN_PIN31_Min (0x0UL)                  /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_IN_PIN31_Max (0x1UL)                  /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_IN_PIN31_Low (0x0UL)                  /*!< Pin input is low                                                     */
  #define GPIO_IN_PIN31_High (0x1UL)                 /*!< Pin input is high                                                    */


/* GPIO_DIR: Direction of GPIO pins */
  #define GPIO_DIR_ResetValue (0x00000000UL)         /*!< Reset value of DIR register.                                         */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_DIR_PIN0_Pos (0UL)                    /*!< Position of PIN0 field.                                              */
  #define GPIO_DIR_PIN0_Msk (0x1UL << GPIO_DIR_PIN0_Pos) /*!< Bit mask of PIN0 field.                                          */
  #define GPIO_DIR_PIN0_Min (0x0UL)                  /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_DIR_PIN0_Max (0x1UL)                  /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_DIR_PIN0_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN0_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_DIR_PIN1_Pos (1UL)                    /*!< Position of PIN1 field.                                              */
  #define GPIO_DIR_PIN1_Msk (0x1UL << GPIO_DIR_PIN1_Pos) /*!< Bit mask of PIN1 field.                                          */
  #define GPIO_DIR_PIN1_Min (0x0UL)                  /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_DIR_PIN1_Max (0x1UL)                  /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_DIR_PIN1_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN1_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_DIR_PIN2_Pos (2UL)                    /*!< Position of PIN2 field.                                              */
  #define GPIO_DIR_PIN2_Msk (0x1UL << GPIO_DIR_PIN2_Pos) /*!< Bit mask of PIN2 field.                                          */
  #define GPIO_DIR_PIN2_Min (0x0UL)                  /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_DIR_PIN2_Max (0x1UL)                  /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_DIR_PIN2_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN2_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_DIR_PIN3_Pos (3UL)                    /*!< Position of PIN3 field.                                              */
  #define GPIO_DIR_PIN3_Msk (0x1UL << GPIO_DIR_PIN3_Pos) /*!< Bit mask of PIN3 field.                                          */
  #define GPIO_DIR_PIN3_Min (0x0UL)                  /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_DIR_PIN3_Max (0x1UL)                  /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_DIR_PIN3_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN3_Output (0x1UL)               /*!< Pin set as output                                                    */

