NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* PIN0 @Bit 0 : Set as input pin 0 */
  #define GPIO_DIRCLR_PIN0_Pos (0UL)                 /*!< Position of PIN0 field.                                              */
  #define GPIO_DIRCLR_PIN0_Msk (0x1UL << GPIO_DIRCLR_PIN0_Pos) /*!< Bit mask of PIN0 field.                                    */
  #define GPIO_DIRCLR_PIN0_Min (0x0UL)               /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_DIRCLR_PIN0_Max (0x1UL)               /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_DIRCLR_PIN0_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN0_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN0_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN1 @Bit 1 : Set as input pin 1 */
  #define GPIO_DIRCLR_PIN1_Pos (1UL)                 /*!< Position of PIN1 field.                                              */
  #define GPIO_DIRCLR_PIN1_Msk (0x1UL << GPIO_DIRCLR_PIN1_Pos) /*!< Bit mask of PIN1 field.                                    */
  #define GPIO_DIRCLR_PIN1_Min (0x0UL)               /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_DIRCLR_PIN1_Max (0x1UL)               /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_DIRCLR_PIN1_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN1_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN1_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN2 @Bit 2 : Set as input pin 2 */
  #define GPIO_DIRCLR_PIN2_Pos (2UL)                 /*!< Position of PIN2 field.                                              */
  #define GPIO_DIRCLR_PIN2_Msk (0x1UL << GPIO_DIRCLR_PIN2_Pos) /*!< Bit mask of PIN2 field.                                    */
  #define GPIO_DIRCLR_PIN2_Min (0x0UL)               /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_DIRCLR_PIN2_Max (0x1UL)               /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_DIRCLR_PIN2_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN2_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN2_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN3 @Bit 3 : Set as input pin 3 */
  #define GPIO_DIRCLR_PIN3_Pos (3UL)                 /*!< Position of PIN3 field.                                              */
  #define GPIO_DIRCLR_PIN3_Msk (0x1UL << GPIO_DIRCLR_PIN3_Pos) /*!< Bit mask of PIN3 field.                                    */
  #define GPIO_DIRCLR_PIN3_Min (0x0UL)               /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_DIRCLR_PIN3_Max (0x1UL)               /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_DIRCLR_PIN3_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN3_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN3_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN4 @Bit 4 : Set as input pin 4 */
  #define GPIO_DIRCLR_PIN4_Pos (4UL)                 /*!< Position of PIN4 field.                                              */
  #define GPIO_DIRCLR_PIN4_Msk (0x1UL << GPIO_DIRCLR_PIN4_Pos) /*!< Bit mask of PIN4 field.                                    */
  #define GPIO_DIRCLR_PIN4_Min (0x0UL)               /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_DIRCLR_PIN4_Max (0x1UL)               /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_DIRCLR_PIN4_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN4_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN4_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN5 @Bit 5 : Set as input pin 5 */
  #define GPIO_DIRCLR_PIN5_Pos (5UL)                 /*!< Position of PIN5 field.                                              */
  #define GPIO_DIRCLR_PIN5_Msk (0x1UL << GPIO_DIRCLR_PIN5_Pos) /*!< Bit mask of PIN5 field.                                    */
  #define GPIO_DIRCLR_PIN5_Min (0x0UL)               /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_DIRCLR_PIN5_Max (0x1UL)               /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_DIRCLR_PIN5_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN5_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN5_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN6 @Bit 6 : Set as input pin 6 */
  #define GPIO_DIRCLR_PIN6_Pos (6UL)                 /*!< Position of PIN6 field.                                              */
  #define GPIO_DIRCLR_PIN6_Msk (0x1UL << GPIO_DIRCLR_PIN6_Pos) /*!< Bit mask of PIN6 field.                                    */
  #define GPIO_DIRCLR_PIN6_Min (0x0UL)               /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_DIRCLR_PIN6_Max (0x1UL)               /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_DIRCLR_PIN6_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN6_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN6_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

