NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task OUT[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_OUT_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_SUBSCRIBE_SET: Subscribe configuration for task SET[n] */
  #define GPIOTE_SUBSCRIBE_SET_MaxCount (8UL)        /*!< Max size of SUBSCRIBE_SET[8] array.                                  */
  #define GPIOTE_SUBSCRIBE_SET_MaxIndex (7UL)        /*!< Max index of SUBSCRIBE_SET[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_SET_MinIndex (0UL)        /*!< Min index of SUBSCRIBE_SET[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_SET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SET[8] register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task SET[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_SET_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_SET_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_SET_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_SET_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_SET_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_SET_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_SET_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_SET_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_SUBSCRIBE_CLR: Subscribe configuration for task CLR[n] */
  #define GPIOTE_SUBSCRIBE_CLR_MaxCount (8UL)        /*!< Max size of SUBSCRIBE_CLR[8] array.                                  */
  #define GPIOTE_SUBSCRIBE_CLR_MaxIndex (7UL)        /*!< Max index of SUBSCRIBE_CLR[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_CLR_MinIndex (0UL)        /*!< Min index of SUBSCRIBE_CLR[8] array.                                 */
  #define GPIOTE_SUBSCRIBE_CLR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CLR[8] register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task CLR[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_CLR_EN_Pos) /*!< Bit mask of EN field.                        */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* GPIOTE_EVENTS_IN: Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_MaxCount (8UL)            /*!< Max size of EVENTS_IN[8] array.                                      */
  #define GPIOTE_EVENTS_IN_MaxIndex (7UL)            /*!< Max index of EVENTS_IN[8] array.                                     */
  #define GPIOTE_EVENTS_IN_MinIndex (0UL)            /*!< Min index of EVENTS_IN[8] array.                                     */
  #define GPIOTE_EVENTS_IN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IN[8] register.                                */

/* EVENTS_IN @Bit 0 : Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Pos (0UL)       /*!< Position of EVENTS_IN field.                                         */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Msk (0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos) /*!< Bit mask of EVENTS_IN field.           */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Min (0x0UL)     /*!< Min enumerator value of EVENTS_IN field.                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Max (0x1UL)     /*!< Max enumerator value of EVENTS_IN field.                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Generated (0x1UL) /*!< Event generated                                                    */


/* GPIOTE_PUBLISH_IN: Publish configuration for event IN[n] */
  #define GPIOTE_PUBLISH_IN_MaxCount (8UL)           /*!< Max size of PUBLISH_IN[8] array.                                     */
  #define GPIOTE_PUBLISH_IN_MaxIndex (7UL)           /*!< Max index of PUBLISH_IN[8] array.                                    */
  #define GPIOTE_PUBLISH_IN_MinIndex (0UL)           /*!< Min index of PUBLISH_IN[8] array.                                    */
  #define GPIOTE_PUBLISH_IN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_IN[8] register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event IN[n] will publish to */
  #define GPIOTE_PUBLISH_IN_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define GPIOTE_PUBLISH_IN_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_IN_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define GPIOTE_PUBLISH_IN_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define GPIOTE_PUBLISH_IN_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_IN_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define GPIOTE_PUBLISH_IN_EN_Msk (0x1UL << GPIOTE_PUBLISH_IN_EN_Pos) /*!< Bit mask of EN field.                              */
  #define GPIOTE_PUBLISH_IN_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_IN_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define GPIOTE_PUBLISH_IN_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define GPIOTE_PUBLISH_IN_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* GPIOTE_INTENSET0: Enable interrupt */
  #define GPIOTE_INTENSET0_ResetValue (0x00000000UL) /*!< Reset value of INTENSET0 register.                                   */

/* IN0 @Bit 0 : Write '1' to enable interrupt for event IN[0] */
  #define GPIOTE_INTENSET0_IN0_Pos (0UL)             /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTENSET0_IN0_Msk (0x1UL << GPIOTE_INTENSET0_IN0_Pos) /*!< Bit mask of IN0 field.                             */
  #define GPIOTE_INTENSET0_IN0_Min (0x0UL)           /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENSET0_IN0_Max (0x1UL)           /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENSET0_IN0_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN1 @Bit 1 : Write '1' to enable interrupt for event IN[1] */
  #define GPIOTE_INTENSET0_IN1_Pos (1UL)             /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTENSET0_IN1_Msk (0x1UL << GPIOTE_INTENSET0_IN1_Pos) /*!< Bit mask of IN1 field.                             */
  #define GPIOTE_INTENSET0_IN1_Min (0x0UL)           /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENSET0_IN1_Max (0x1UL)           /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENSET0_IN1_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN2 @Bit 2 : Write '1' to enable interrupt for event IN[2] */
  #define GPIOTE_INTENSET0_IN2_Pos (2UL)             /*!< Position of IN2 field.                                               */
  #define GPIOTE_INTENSET0_IN2_Msk (0x1UL << GPIOTE_INTENSET0_IN2_Pos) /*!< Bit mask of IN2 field.                             */
  #define GPIOTE_INTENSET0_IN2_Min (0x0UL)           /*!< Min enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENSET0_IN2_Max (0x1UL)           /*!< Max enumerator value of IN2 field.                                   */
  #define GPIOTE_INTENSET0_IN2_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN2_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN2_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN3 @Bit 3 : Write '1' to enable interrupt for event IN[3] */
  #define GPIOTE_INTENSET0_IN3_Pos (3UL)             /*!< Position of IN3 field.                                               */
  #define GPIOTE_INTENSET0_IN3_Msk (0x1UL << GPIOTE_INTENSET0_IN3_Pos) /*!< Bit mask of IN3 field.                             */
  #define GPIOTE_INTENSET0_IN3_Min (0x0UL)           /*!< Min enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENSET0_IN3_Max (0x1UL)           /*!< Max enumerator value of IN3 field.                                   */
  #define GPIOTE_INTENSET0_IN3_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN3_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN3_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN4 @Bit 4 : Write '1' to enable interrupt for event IN[4] */
  #define GPIOTE_INTENSET0_IN4_Pos (4UL)             /*!< Position of IN4 field.                                               */
  #define GPIOTE_INTENSET0_IN4_Msk (0x1UL << GPIOTE_INTENSET0_IN4_Pos) /*!< Bit mask of IN4 field.                             */
  #define GPIOTE_INTENSET0_IN4_Min (0x0UL)           /*!< Min enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENSET0_IN4_Max (0x1UL)           /*!< Max enumerator value of IN4 field.                                   */
  #define GPIOTE_INTENSET0_IN4_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN4_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN4_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN5 @Bit 5 : Write '1' to enable interrupt for event IN[5] */
  #define GPIOTE_INTENSET0_IN5_Pos (5UL)             /*!< Position of IN5 field.                                               */
  #define GPIOTE_INTENSET0_IN5_Msk (0x1UL << GPIOTE_INTENSET0_IN5_Pos) /*!< Bit mask of IN5 field.                             */
  #define GPIOTE_INTENSET0_IN5_Min (0x0UL)           /*!< Min enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENSET0_IN5_Max (0x1UL)           /*!< Max enumerator value of IN5 field.                                   */
  #define GPIOTE_INTENSET0_IN5_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN5_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN5_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN6 @Bit 6 : Write '1' to enable interrupt for event IN[6] */
  #define GPIOTE_INTENSET0_IN6_Pos (6UL)             /*!< Position of IN6 field.                                               */
  #define GPIOTE_INTENSET0_IN6_Msk (0x1UL << GPIOTE_INTENSET0_IN6_Pos) /*!< Bit mask of IN6 field.                             */
  #define GPIOTE_INTENSET0_IN6_Min (0x0UL)           /*!< Min enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENSET0_IN6_Max (0x1UL)           /*!< Max enumerator value of IN6 field.                                   */
  #define GPIOTE_INTENSET0_IN6_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN6_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN6_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN7 @Bit 7 : Write '1' to enable interrupt for event IN[7] */
  #define GPIOTE_INTENSET0_IN7_Pos (7UL)             /*!< Position of IN7 field.                                               */
  #define GPIOTE_INTENSET0_IN7_Msk (0x1UL << GPIOTE_INTENSET0_IN7_Pos) /*!< Bit mask of IN7 field.                             */
  #define GPIOTE_INTENSET0_IN7_Min (0x0UL)           /*!< Min enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENSET0_IN7_Max (0x1UL)           /*!< Max enumerator value of IN7 field.                                   */
  #define GPIOTE_INTENSET0_IN7_Set (0x1UL)           /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_IN7_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENSET0_IN7_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* PORT0NONSECURE @Bit 16 : Write '1' to enable interrupt for event PORT0NONSECURE */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Pos (16UL) /*!< Position of PORT0NONSECURE field.                                    */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Msk (0x1UL << GPIOTE_INTENSET0_PORT0NONSECURE_Pos) /*!< Bit mask of PORT0NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Min (0x0UL) /*!< Min enumerator value of PORT0NONSECURE field.                       */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Max (0x1UL) /*!< Max enumerator value of PORT0NONSECURE field.                       */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Set (0x1UL) /*!< Enable                                                              */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* PORT0SECURE @Bit 17 : Write '1' to enable interrupt for event PORT0SECURE */
  #define GPIOTE_INTENSET0_PORT0SECURE_Pos (17UL)    /*!< Position of PORT0SECURE field.                                       */
  #define GPIOTE_INTENSET0_PORT0SECURE_Msk (0x1UL << GPIOTE_INTENSET0_PORT0SECURE_Pos) /*!< Bit mask of PORT0SECURE field.     */
  #define GPIOTE_INTENSET0_PORT0SECURE_Min (0x0UL)   /*!< Min enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTENSET0_PORT0SECURE_Max (0x1UL)   /*!< Max enumerator value of PORT0SECURE field.                           */
  #define GPIOTE_INTENSET0_PORT0SECURE_Set (0x1UL)   /*!< Enable                                                               */
  #define GPIOTE_INTENSET0_PORT0SECURE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GPIOTE_INTENSET0_PORT0SECURE_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GPIOTE_INTENCLR0: Disable interrupt */
  #define GPIOTE_INTENCLR0_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR0 register.                                   */

/* IN0 @Bit 0 : Write '1' to disable interrupt for event IN[0] */
  #define GPIOTE_INTENCLR0_IN0_Pos (0UL)             /*!< Position of IN0 field.                                               */
  #define GPIOTE_INTENCLR0_IN0_Msk (0x1UL << GPIOTE_INTENCLR0_IN0_Pos) /*!< Bit mask of IN0 field.                             */
  #define GPIOTE_INTENCLR0_IN0_Min (0x0UL)           /*!< Min enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR0_IN0_Max (0x1UL)           /*!< Max enumerator value of IN0 field.                                   */
  #define GPIOTE_INTENCLR0_IN0_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN0_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN0_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* IN1 @Bit 1 : Write '1' to disable interrupt for event IN[1] */
  #define GPIOTE_INTENCLR0_IN1_Pos (1UL)             /*!< Position of IN1 field.                                               */
  #define GPIOTE_INTENCLR0_IN1_Msk (0x1UL << GPIOTE_INTENCLR0_IN1_Pos) /*!< Bit mask of IN1 field.                             */
  #define GPIOTE_INTENCLR0_IN1_Min (0x0UL)           /*!< Min enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR0_IN1_Max (0x1UL)           /*!< Max enumerator value of IN1 field.                                   */
  #define GPIOTE_INTENCLR0_IN1_Clear (0x1UL)         /*!< Disable                                                              */
  #define GPIOTE_INTENCLR0_IN1_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define GPIOTE_INTENCLR0_IN1_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

