NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* I2S_PUBLISH_FRAMESTART: Publish configuration for event FRAMESTART */
  #define I2S_PUBLISH_FRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FRAMESTART register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMESTART will publish to */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Msk (0xFFUL << I2S_PUBLISH_FRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_FRAMESTART_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define I2S_PUBLISH_FRAMESTART_EN_Msk (0x1UL << I2S_PUBLISH_FRAMESTART_EN_Pos) /*!< Bit mask of EN field.                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define I2S_PUBLISH_FRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define I2S_PUBLISH_FRAMESTART_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* I2S_INTEN: Enable or disable interrupt */
  #define I2S_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* RXPTRUPD @Bit 1 : Enable or disable interrupt for event RXPTRUPD */
  #define I2S_INTEN_RXPTRUPD_Pos (1UL)               /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTEN_RXPTRUPD_Msk (0x1UL << I2S_INTEN_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                            */
  #define I2S_INTEN_RXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTEN_RXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTEN_RXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_RXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define I2S_INTEN_STOPPED_Pos (2UL)                /*!< Position of STOPPED field.                                           */
  #define I2S_INTEN_STOPPED_Msk (0x1UL << I2S_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define I2S_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* TXPTRUPD @Bit 5 : Enable or disable interrupt for event TXPTRUPD */
  #define I2S_INTEN_TXPTRUPD_Pos (5UL)               /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTEN_TXPTRUPD_Msk (0x1UL << I2S_INTEN_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                            */
  #define I2S_INTEN_TXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTEN_TXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTEN_TXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define I2S_INTEN_TXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* FRAMESTART @Bit 7 : Enable or disable interrupt for event FRAMESTART */
  #define I2S_INTEN_FRAMESTART_Pos (7UL)             /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTEN_FRAMESTART_Msk (0x1UL << I2S_INTEN_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                      */
  #define I2S_INTEN_FRAMESTART_Min (0x0UL)           /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTEN_FRAMESTART_Max (0x1UL)           /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTEN_FRAMESTART_Disabled (0x0UL)      /*!< Disable                                                              */
  #define I2S_INTEN_FRAMESTART_Enabled (0x1UL)       /*!< Enable                                                               */


/* I2S_INTENSET: Enable interrupt */
  #define I2S_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* RXPTRUPD @Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
  #define I2S_INTENSET_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define I2S_INTENSET_RXPTRUPD_Msk (0x1UL << I2S_INTENSET_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define I2S_INTENSET_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENSET_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define I2S_INTENSET_RXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define I2S_INTENSET_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define I2S_INTENSET_STOPPED_Msk (0x1UL << I2S_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define I2S_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define I2S_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define I2S_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define I2S_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 5 : Write '1' to enable interrupt for event TXPTRUPD */
  #define I2S_INTENSET_TXPTRUPD_Pos (5UL)            /*!< Position of TXPTRUPD field.                                          */
  #define I2S_INTENSET_TXPTRUPD_Msk (0x1UL << I2S_INTENSET_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define I2S_INTENSET_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENSET_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define I2S_INTENSET_TXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define I2S_INTENSET_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* FRAMESTART @Bit 7 : Write '1' to enable interrupt for event FRAMESTART */
  #define I2S_INTENSET_FRAMESTART_Pos (7UL)          /*!< Position of FRAMESTART field.                                        */
  #define I2S_INTENSET_FRAMESTART_Msk (0x1UL << I2S_INTENSET_FRAMESTART_Pos) /*!< Bit mask of FRAMESTART field.                */
  #define I2S_INTENSET_FRAMESTART_Min (0x0UL)        /*!< Min enumerator value of FRAMESTART field.                            */
  #define I2S_INTENSET_FRAMESTART_Max (0x1UL)        /*!< Max enumerator value of FRAMESTART field.                            */
  #define I2S_INTENSET_FRAMESTART_Set (0x1UL)        /*!< Enable                                                               */
  #define I2S_INTENSET_FRAMESTART_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define I2S_INTENSET_FRAMESTART_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* I2S_INTENCLR: Disable interrupt */
  #define I2S_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

