NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* ===================================================== Struct NFCT_TXD ===================================================== */
/**
  * @brief TXD [NFCT_TXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FRAMECONFIG;                       /*!< (@ 0x00000000) Configuration of outgoing frames                      */
  __IOM uint32_t  AMOUNT;                            /*!< (@ 0x00000004) Size of outgoing frame                                */
} NRF_NFCT_TXD_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* NFCT_TXD_FRAMECONFIG: Configuration of outgoing frames */
  #define NFCT_TXD_FRAMECONFIG_ResetValue (0x00000017UL) /*!< Reset value of FRAMECONFIG register.                             */

/* PARITY @Bit 0 : Indicates if parity is added to the frame */
  #define NFCT_TXD_FRAMECONFIG_PARITY_Pos (0UL)      /*!< Position of PARITY field.                                            */
  #define NFCT_TXD_FRAMECONFIG_PARITY_Msk (0x1UL << NFCT_TXD_FRAMECONFIG_PARITY_Pos) /*!< Bit mask of PARITY field.            */
  #define NFCT_TXD_FRAMECONFIG_PARITY_Min (0x0UL)    /*!< Min enumerator value of PARITY field.                                */
  #define NFCT_TXD_FRAMECONFIG_PARITY_Max (0x1UL)    /*!< Max enumerator value of PARITY field.                                */
  #define NFCT_TXD_FRAMECONFIG_PARITY_NoParity (0x0UL) /*!< Parity is not added to TX frames                                   */
  #define NFCT_TXD_FRAMECONFIG_PARITY_Parity (0x1UL) /*!< Parity is added to TX frames                                         */

/* DISCARDMODE @Bit 1 : Discarding unused bits at start or end of a frame */
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos (1UL) /*!< Position of DISCARDMODE field.                                       */
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Msk (0x1UL << NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos) /*!< Bit mask of DISCARDMODE
                                                                            field.*/
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Min (0x0UL) /*!< Min enumerator value of DISCARDMODE field.                         */
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Max (0x1UL) /*!< Max enumerator value of DISCARDMODE field.                         */
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardEnd (0x0UL) /*!< Unused bits are discarded at end of frame (EoF)             */
  #define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardStart (0x1UL) /*!< Unused bits are discarded at start of frame (SoF)         */

/* SOF @Bit 2 : Adding SoF or not in TX frames */
  #define NFCT_TXD_FRAMECONFIG_SOF_Pos (2UL)         /*!< Position of SOF field.                                               */
  #define NFCT_TXD_FRAMECONFIG_SOF_Msk (0x1UL << NFCT_TXD_FRAMECONFIG_SOF_Pos) /*!< Bit mask of SOF field.                     */
  #define NFCT_TXD_FRAMECONFIG_SOF_Min (0x0UL)       /*!< Min enumerator value of SOF field.                                   */
  #define NFCT_TXD_FRAMECONFIG_SOF_Max (0x1UL)       /*!< Max enumerator value of SOF field.                                   */
  #define NFCT_TXD_FRAMECONFIG_SOF_NoSoF (0x0UL)     /*!< SoF symbol not added                                                 */
  #define NFCT_TXD_FRAMECONFIG_SOF_SoF (0x1UL)       /*!< SoF symbol added                                                     */

/* CRCMODETX @Bit 4 : CRC mode for outgoing frames */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos (4UL)   /*!< Position of CRCMODETX field.                                         */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_Msk (0x1UL << NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos) /*!< Bit mask of CRCMODETX field.   */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_Min (0x0UL) /*!< Min enumerator value of CRCMODETX field.                             */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_Max (0x1UL) /*!< Max enumerator value of CRCMODETX field.                             */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_NoCRCTX (0x0UL) /*!< CRC is not added to the frame                                    */
  #define NFCT_TXD_FRAMECONFIG_CRCMODETX_CRC16TX (0x1UL) /*!< 16 bit CRC added to the frame based on all the data read from RAM
                                                              that is used in the frame*/


/* NFCT_TXD_AMOUNT: Size of outgoing frame */
  #define NFCT_TXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* TXDATABITS @Bits 0..2 : Number of bits in the last or first byte read from RAM that shall be included in the frame (excluding
                           parity bit). */

  #define NFCT_TXD_AMOUNT_TXDATABITS_Pos (0UL)       /*!< Position of TXDATABITS field.                                        */
  #define NFCT_TXD_AMOUNT_TXDATABITS_Msk (0x7UL << NFCT_TXD_AMOUNT_TXDATABITS_Pos) /*!< Bit mask of TXDATABITS field.          */
  #define NFCT_TXD_AMOUNT_TXDATABITS_Min (0x0UL)     /*!< Min value of TXDATABITS field.                                       */
  #define NFCT_TXD_AMOUNT_TXDATABITS_Max (0x7UL)     /*!< Max size of TXDATABITS field.                                        */

/* TXDATABYTES @Bits 3..11 : Number of complete bytes that shall be included in the frame, excluding CRC, parity, and framing. */
  #define NFCT_TXD_AMOUNT_TXDATABYTES_Pos (3UL)      /*!< Position of TXDATABYTES field.                                       */
  #define NFCT_TXD_AMOUNT_TXDATABYTES_Msk (0x1FFUL << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) /*!< Bit mask of TXDATABYTES field.     */
  #define NFCT_TXD_AMOUNT_TXDATABYTES_Min (0x000UL)  /*!< Min value of TXDATABYTES field.                                      */
  #define NFCT_TXD_AMOUNT_TXDATABYTES_Max (0x101UL)  /*!< Max size of TXDATABYTES field.                                       */



/* ===================================================== Struct NFCT_RXD ===================================================== */
/**
  * @brief RXD [NFCT_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FRAMECONFIG;                       /*!< (@ 0x00000000) Configuration of incoming frames                      */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000004) Size of last incoming frame                           */
} NRF_NFCT_RXD_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* NFCT_RXD_FRAMECONFIG: Configuration of incoming frames */
  #define NFCT_RXD_FRAMECONFIG_ResetValue (0x00000015UL) /*!< Reset value of FRAMECONFIG register.                             */

/* PARITY @Bit 0 : Indicates if parity expected in RX frame */
  #define NFCT_RXD_FRAMECONFIG_PARITY_Pos (0UL)      /*!< Position of PARITY field.                                            */
  #define NFCT_RXD_FRAMECONFIG_PARITY_Msk (0x1UL << NFCT_RXD_FRAMECONFIG_PARITY_Pos) /*!< Bit mask of PARITY field.            */
  #define NFCT_RXD_FRAMECONFIG_PARITY_Min (0x0UL)    /*!< Min enumerator value of PARITY field.                                */
  #define NFCT_RXD_FRAMECONFIG_PARITY_Max (0x1UL)    /*!< Max enumerator value of PARITY field.                                */
  #define NFCT_RXD_FRAMECONFIG_PARITY_NoParity (0x0UL) /*!< Parity is not expected in RX frames                                */
  #define NFCT_RXD_FRAMECONFIG_PARITY_Parity (0x1UL) /*!< Parity is expected in RX frames                                      */

/* SOF @Bit 2 : SoF expected or not in RX frames */
  #define NFCT_RXD_FRAMECONFIG_SOF_Pos (2UL)         /*!< Position of SOF field.                                               */
  #define NFCT_RXD_FRAMECONFIG_SOF_Msk (0x1UL << NFCT_RXD_FRAMECONFIG_SOF_Pos) /*!< Bit mask of SOF field.                     */
  #define NFCT_RXD_FRAMECONFIG_SOF_Min (0x0UL)       /*!< Min enumerator value of SOF field.                                   */
  #define NFCT_RXD_FRAMECONFIG_SOF_Max (0x1UL)       /*!< Max enumerator value of SOF field.                                   */
  #define NFCT_RXD_FRAMECONFIG_SOF_NoSoF (0x0UL)     /*!< SoF symbol is not expected in RX frames                              */
  #define NFCT_RXD_FRAMECONFIG_SOF_SoF (0x1UL)       /*!< SoF symbol is expected in RX frames                                  */

/* CRCMODERX @Bit 4 : CRC mode for incoming frames */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_Pos (4UL)   /*!< Position of CRCMODERX field.                                         */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_Msk (0x1UL << NFCT_RXD_FRAMECONFIG_CRCMODERX_Pos) /*!< Bit mask of CRCMODERX field.   */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_Min (0x0UL) /*!< Min enumerator value of CRCMODERX field.                             */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_Max (0x1UL) /*!< Max enumerator value of CRCMODERX field.                             */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_NoCRCRX (0x0UL) /*!< CRC is not expected in RX frames                                 */
  #define NFCT_RXD_FRAMECONFIG_CRCMODERX_CRC16RX (0x1UL) /*!< Last 16 bits in RX frame is CRC, CRC is checked and CRCSTATUS
                                                              updated*/


