NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* PWM_DECODER: Configuration of the decoder */
  #define PWM_DECODER_ResetValue (0x00000000UL)      /*!< Reset value of DECODER register.                                     */

/* LOAD @Bits 0..1 : How a sequence is read from RAM and spread to the compare register */
  #define PWM_DECODER_LOAD_Pos (0UL)                 /*!< Position of LOAD field.                                              */
  #define PWM_DECODER_LOAD_Msk (0x3UL << PWM_DECODER_LOAD_Pos) /*!< Bit mask of LOAD field.                                    */
  #define PWM_DECODER_LOAD_Min (0x0UL)               /*!< Min enumerator value of LOAD field.                                  */
  #define PWM_DECODER_LOAD_Max (0x3UL)               /*!< Max enumerator value of LOAD field.                                  */
  #define PWM_DECODER_LOAD_Common (0x0UL)            /*!< 1st half word (16-bit) used in all PWM channels 0..3                 */
  #define PWM_DECODER_LOAD_Grouped (0x1UL)           /*!< 1st half word (16-bit) used in channel 0..1; 2nd word in channel 2..3*/
  #define PWM_DECODER_LOAD_Individual (0x2UL)        /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in ch.3        */
  #define PWM_DECODER_LOAD_WaveForm (0x3UL)          /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in COUNTERTOP  */

/* MODE @Bit 8 : Selects source for advancing the active sequence */
  #define PWM_DECODER_MODE_Pos (8UL)                 /*!< Position of MODE field.                                              */
  #define PWM_DECODER_MODE_Msk (0x1UL << PWM_DECODER_MODE_Pos) /*!< Bit mask of MODE field.                                    */
  #define PWM_DECODER_MODE_Min (0x0UL)               /*!< Min enumerator value of MODE field.                                  */
  #define PWM_DECODER_MODE_Max (0x1UL)               /*!< Max enumerator value of MODE field.                                  */
  #define PWM_DECODER_MODE_RefreshCount (0x0UL)      /*!< SEQ[n].REFRESH is used to determine loading internal compare
                                                          registers*/
  #define PWM_DECODER_MODE_NextStep (0x1UL)          /*!< NEXTSTEP task causes a new value to be loaded to internal compare
                                                          registers*/


/* PWM_LOOP: Number of playbacks of a loop */
  #define PWM_LOOP_ResetValue (0x00000000UL)         /*!< Reset value of LOOP register.                                        */

/* CNT @Bits 0..15 : Number of playbacks of pattern cycles */
  #define PWM_LOOP_CNT_Pos (0UL)                     /*!< Position of CNT field.                                               */
  #define PWM_LOOP_CNT_Msk (0xFFFFUL << PWM_LOOP_CNT_Pos) /*!< Bit mask of CNT field.                                          */
  #define PWM_LOOP_CNT_Min (0x0000UL)                /*!< Min enumerator value of CNT field.                                   */
  #define PWM_LOOP_CNT_Max (0x0000UL)                /*!< Max enumerator value of CNT field.                                   */
  #define PWM_LOOP_CNT_Disabled (0x0000UL)           /*!< Looping disabled (stop at the end of the sequence)                   */


/* PWM_IDLEOUT: Configure the output value on the PWM channel during idle */
  #define PWM_IDLEOUT_ResetValue (0x00000000UL)      /*!< Reset value of IDLEOUT register.                                     */

/* VAL0 @Bit 0 : Idle output value for PWM channel [0] */
  #define PWM_IDLEOUT_VAL0_Pos (0UL)                 /*!< Position of VAL0 field.                                              */
  #define PWM_IDLEOUT_VAL0_Msk (0x1UL << PWM_IDLEOUT_VAL0_Pos) /*!< Bit mask of VAL0 field.                                    */

/* VAL1 @Bit 1 : Idle output value for PWM channel [1] */
  #define PWM_IDLEOUT_VAL1_Pos (1UL)                 /*!< Position of VAL1 field.                                              */
  #define PWM_IDLEOUT_VAL1_Msk (0x1UL << PWM_IDLEOUT_VAL1_Pos) /*!< Bit mask of VAL1 field.                                    */

/* VAL2 @Bit 2 : Idle output value for PWM channel [2] */
  #define PWM_IDLEOUT_VAL2_Pos (2UL)                 /*!< Position of VAL2 field.                                              */
  #define PWM_IDLEOUT_VAL2_Msk (0x1UL << PWM_IDLEOUT_VAL2_Pos) /*!< Bit mask of VAL2 field.                                    */

/* VAL3 @Bit 3 : Idle output value for PWM channel [3] */
  #define PWM_IDLEOUT_VAL3_Pos (3UL)                 /*!< Position of VAL3 field.                                              */
  #define PWM_IDLEOUT_VAL3_Msk (0x1UL << PWM_IDLEOUT_VAL3_Pos) /*!< Bit mask of VAL3 field.                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           QDEC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct QDEC_PSEL ===================================================== */
/**
  * @brief PSEL [QDEC_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LED;                               /*!< (@ 0x00000000) Pin select for LED signal                             */
  __IOM uint32_t  A;                                 /*!< (@ 0x00000004) Pin select for A signal                               */
  __IOM uint32_t  B;                                 /*!< (@ 0x00000008) Pin select for B signal                               */
} NRF_QDEC_PSEL_Type;                                /*!< Size = 12 (0x00C)                                                    */

/* QDEC_PSEL_LED: Pin select for LED signal */
  #define QDEC_PSEL_LED_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of LED register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_LED_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define QDEC_PSEL_LED_PIN_Msk (0x1FUL << QDEC_PSEL_LED_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define QDEC_PSEL_LED_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define QDEC_PSEL_LED_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define QDEC_PSEL_LED_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define QDEC_PSEL_LED_PORT_Msk (0x7UL << QDEC_PSEL_LED_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define QDEC_PSEL_LED_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define QDEC_PSEL_LED_PORT_Max (0x7UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_LED_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define QDEC_PSEL_LED_CONNECT_Msk (0x1UL << QDEC_PSEL_LED_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define QDEC_PSEL_LED_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_LED_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_LED_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define QDEC_PSEL_LED_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* QDEC_PSEL_A: Pin select for A signal */
  #define QDEC_PSEL_A_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of A register.                                           */

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_A_PIN_Pos (0UL)                  /*!< Position of PIN field.                                               */
  #define QDEC_PSEL_A_PIN_Msk (0x1FUL << QDEC_PSEL_A_PIN_Pos) /*!< Bit mask of PIN field.                                      */
  #define QDEC_PSEL_A_PIN_Min (0x00UL)               /*!< Min value of PIN field.                                              */
  #define QDEC_PSEL_A_PIN_Max (0x1FUL)               /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define QDEC_PSEL_A_PORT_Pos (5UL)                 /*!< Position of PORT field.                                              */
  #define QDEC_PSEL_A_PORT_Msk (0x7UL << QDEC_PSEL_A_PORT_Pos) /*!< Bit mask of PORT field.                                    */
  #define QDEC_PSEL_A_PORT_Min (0x0UL)               /*!< Min value of PORT field.                                             */
  #define QDEC_PSEL_A_PORT_Max (0x7UL)               /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_A_CONNECT_Pos (31UL)             /*!< Position of CONNECT field.                                           */
  #define QDEC_PSEL_A_CONNECT_Msk (0x1UL << QDEC_PSEL_A_CONNECT_Pos) /*!< Bit mask of CONNECT field.                           */
  #define QDEC_PSEL_A_CONNECT_Min (0x0UL)            /*!< Min enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_A_CONNECT_Max (0x1UL)            /*!< Max enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_A_CONNECT_Disconnected (0x1UL)   /*!< Disconnect                                                           */
  #define QDEC_PSEL_A_CONNECT_Connected (0x0UL)      /*!< Connect                                                              */


