NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* RATE2M @Bits 4..6 : For modes with 2 Mbps on-air bit rate, unit is 1 bit period (Nrf_2Mbit, Ble_2Mbit, and Ieee802154_250Kbit
                       modes) */

  #define RADIO_PHYENDTXDELAY_RATE2M_Pos (4UL)       /*!< Position of RATE2M field.                                            */
  #define RADIO_PHYENDTXDELAY_RATE2M_Msk (0x7UL << RADIO_PHYENDTXDELAY_RATE2M_Pos) /*!< Bit mask of RATE2M field.              */

/* RATE1M @Bits 8..10 : For modes with 1 Mbps on-air bit rate, unit is 1/2 bit period (Nrf_1Mbit and Ble_1Mbit modes) Also used
                        for Coded phy (Ble_LR125Kbit and Ble_LR500Kbit modes) */

  #define RADIO_PHYENDTXDELAY_RATE1M_Pos (8UL)       /*!< Position of RATE1M field.                                            */
  #define RADIO_PHYENDTXDELAY_RATE1M_Msk (0x7UL << RADIO_PHYENDTXDELAY_RATE1M_Pos) /*!< Bit mask of RATE1M field.              */

/* RATE250K @Bits 12..14 : For modes with 250 kbps on-air bit rate, unit is 1/8 bit period (Nrf_250Kbit mode) */
  #define RADIO_PHYENDTXDELAY_RATE250K_Pos (12UL)    /*!< Position of RATE250K field.                                          */
  #define RADIO_PHYENDTXDELAY_RATE250K_Msk (0x7UL << RADIO_PHYENDTXDELAY_RATE250K_Pos) /*!< Bit mask of RATE250K field.        */


/* RADIO_STATE: Current radio state */
  #define RADIO_STATE_ResetValue (0x00000000UL)      /*!< Reset value of STATE register.                                       */

/* STATE @Bits 0..3 : Current radio state */
  #define RADIO_STATE_STATE_Pos (0UL)                /*!< Position of STATE field.                                             */
  #define RADIO_STATE_STATE_Msk (0xFUL << RADIO_STATE_STATE_Pos) /*!< Bit mask of STATE field.                                 */
  #define RADIO_STATE_STATE_Min (0x0UL)              /*!< Min enumerator value of STATE field.                                 */
  #define RADIO_STATE_STATE_Max (0xCUL)              /*!< Max enumerator value of STATE field.                                 */
  #define RADIO_STATE_STATE_Disabled (0x0UL)         /*!< RADIO is in the DISABLED state                                       */
  #define RADIO_STATE_STATE_RxRu (0x1UL)             /*!< RADIO is in the RXRU state                                           */
  #define RADIO_STATE_STATE_RxIdle (0x2UL)           /*!< RADIO is in the RXIDLE state                                         */
  #define RADIO_STATE_STATE_Rx (0x3UL)               /*!< RADIO is in the RX state                                             */
  #define RADIO_STATE_STATE_RxDisable (0x4UL)        /*!< RADIO is in the RXDISABLE state                                      */
  #define RADIO_STATE_STATE_Settle (0x5UL)           /*!< RADIO is in the SETTLE state                                         */
  #define RADIO_STATE_STATE_Pll (0x6UL)              /*!< RADIO is in the PLL state                                            */
  #define RADIO_STATE_STATE_TxRu (0x9UL)             /*!< RADIO is in the TXRU state                                           */
  #define RADIO_STATE_STATE_TxIdle (0xAUL)           /*!< RADIO is in the TXIDLE state                                         */
  #define RADIO_STATE_STATE_Tx (0xBUL)               /*!< RADIO is in the TX state                                             */
  #define RADIO_STATE_STATE_TxDisable (0xCUL)        /*!< RADIO is in the TXDISABLE state                                      */


/* RADIO_EDCTRL: IEEE 802.15.4 energy detect control */
  #define RADIO_EDCTRL_ResetValue (0x20000000UL)     /*!< Reset value of EDCTRL register.                                      */

/* EDCNT @Bits 0..20 : IEEE 802.15.4 energy detect loop count */
  #define RADIO_EDCTRL_EDCNT_Pos (0UL)               /*!< Position of EDCNT field.                                             */
  #define RADIO_EDCTRL_EDCNT_Msk (0x1FFFFFUL << RADIO_EDCTRL_EDCNT_Pos) /*!< Bit mask of EDCNT field.                          */

/* EDPERIOD @Bits 24..29 : IEEE 802.15.4 energy detect period, 4us resolution, no averaging except the IEEE 802.15.4 ED range
                           128us (32) */

  #define RADIO_EDCTRL_EDPERIOD_Pos (24UL)           /*!< Position of EDPERIOD field.                                          */
  #define RADIO_EDCTRL_EDPERIOD_Msk (0x3FUL << RADIO_EDCTRL_EDPERIOD_Pos) /*!< Bit mask of EDPERIOD field.                     */
  #define RADIO_EDCTRL_EDPERIOD_Min (0x20UL)         /*!< Min enumerator value of EDPERIOD field.                              */
  #define RADIO_EDCTRL_EDPERIOD_Max (0x20UL)         /*!< Max enumerator value of EDPERIOD field.                              */
  #define RADIO_EDCTRL_EDPERIOD_Default (0x20UL)     /*!< (unspecified)                                                        */


/* RADIO_EDSAMPLE: IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_ResetValue (0x00000000UL)   /*!< Reset value of EDSAMPLE register.                                    */

/* EDLVL @Bits 0..7 : IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_EDLVL_Pos (0UL)             /*!< Position of EDLVL field.                                             */
  #define RADIO_EDSAMPLE_EDLVL_Msk (0xFFUL << RADIO_EDSAMPLE_EDLVL_Pos) /*!< Bit mask of EDLVL field.                          */
  #define RADIO_EDSAMPLE_EDLVL_Min (0x00UL)          /*!< Min value of EDLVL field.                                            */
  #define RADIO_EDSAMPLE_EDLVL_Max (0x7FUL)          /*!< Max size of EDLVL field.                                             */


/* RADIO_CCACTRL: IEEE 802.15.4 clear channel assessment control */
  #define RADIO_CCACTRL_ResetValue (0x052D0000UL)    /*!< Reset value of CCACTRL register.                                     */

/* CCAMODE @Bits 0..2 : CCA mode of operation */
  #define RADIO_CCACTRL_CCAMODE_Pos (0UL)            /*!< Position of CCAMODE field.                                           */
  #define RADIO_CCACTRL_CCAMODE_Msk (0x7UL << RADIO_CCACTRL_CCAMODE_Pos) /*!< Bit mask of CCAMODE field.                       */
  #define RADIO_CCACTRL_CCAMODE_Min (0x0UL)          /*!< Min enumerator value of CCAMODE field.                               */
  #define RADIO_CCACTRL_CCAMODE_Max (0x4UL)          /*!< Max enumerator value of CCAMODE field.                               */
  #define RADIO_CCACTRL_CCAMODE_EdMode (0x0UL)       /*!< Energy above threshold                                               */
  #define RADIO_CCACTRL_CCAMODE_CarrierMode (0x1UL)  /*!< Carrier seen                                                         */
  #define RADIO_CCACTRL_CCAMODE_CarrierAndEdMode (0x2UL) /*!< Energy above threshold AND carrier seen                          */
  #define RADIO_CCACTRL_CCAMODE_CarrierOrEdMode (0x3UL) /*!< Energy above threshold OR carrier seen                            */
  #define RADIO_CCACTRL_CCAMODE_EdModeTest1 (0x4UL)  /*!< Energy above threshold test mode that will abort when first ED
                                                          measurement over threshold is seen. No averaging.*/

