NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
  #define TWIS_DMA_TX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                    */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)        /*!< Position of AMOUNT field.                                            */
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Msk (0xFFFFUL << TWIS_DMA_TX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.             */
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)   /*!< Min value of AMOUNT field.                                           */
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Max (0xFFFFUL)   /*!< Max size of AMOUNT field.                                            */


/* TWIS_DMA_TX_LIST: EasyDMA list type */
  #define TWIS_DMA_TX_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                                        */

/* TYPE @Bits 0..2 : List type */
  #define TWIS_DMA_TX_LIST_TYPE_Pos (0UL)            /*!< Position of TYPE field.                                              */
  #define TWIS_DMA_TX_LIST_TYPE_Msk (0x7UL << TWIS_DMA_TX_LIST_TYPE_Pos) /*!< Bit mask of TYPE field.                          */
  #define TWIS_DMA_TX_LIST_TYPE_Min (0x0UL)          /*!< Min enumerator value of TYPE field.                                  */
  #define TWIS_DMA_TX_LIST_TYPE_Max (0x1UL)          /*!< Max enumerator value of TYPE field.                                  */
  #define TWIS_DMA_TX_LIST_TYPE_Disabled (0x0UL)     /*!< Disable EasyDMA list                                                 */
  #define TWIS_DMA_TX_LIST_TYPE_ArrayList (0x1UL)    /*!< Use array list                                                       */


/* TWIS_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


/* TWIS_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TWIS_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                  */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                        */
  #define TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ===================================================== Struct TWIS_DMA ===================================================== */
/**
  * @brief DMA [TWIS_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_TWIS_DMA_RX_Type RX;                     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_TWIS_DMA_TX_Type TX;                     /*!< (@ 0x00000038) (unspecified)                                         */
} NRF_TWIS_DMA_Type;                                 /*!< Size = 92 (0x05C)                                                    */

/* ======================================================= Struct TWIS ======================================================= */
/**
  * @brief I2C compatible Two-Wire Slave Interface with EasyDMA
  */
  typedef struct {                                   /*!< TWIS Structure                                                       */
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop TWI transaction                                  */
    __IM uint32_t RESERVED1;
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000000C) Suspend TWI transaction                               */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000010) Resume TWI transaction                                */
    __IM uint32_t RESERVED2[3];
    __OM uint32_t TASKS_PREPARERX;                   /*!< (@ 0x00000020) Prepare the TWI slave to respond to a write command   */
    __OM uint32_t TASKS_PREPARETX;                   /*!< (@ 0x00000024) Prepare the TWI slave to respond to a read command    */
    __IM uint32_t RESERVED3[2];
    __OM NRF_TWIS_TASKS_DMA_Type TASKS_DMA;          /*!< (@ 0x00000030) Peripheral tasks.                                     */
    __IM uint32_t RESERVED4[13];
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED5;
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000008C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x00000090) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t SUBSCRIBE_PREPARERX;              /*!< (@ 0x000000A0) Subscribe configuration for task PREPARERX            */
    __IOM uint32_t SUBSCRIBE_PREPARETX;              /*!< (@ 0x000000A4) Subscribe configuration for task PREPARETX            */
    __IM uint32_t RESERVED7[2];
    __IOM NRF_TWIS_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA; /*!< (@ 0x000000B0) Subscribe configuration for tasks                     */
    __IM uint32_t RESERVED8[13];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) TWI stopped                                           */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000114) TWI error                                             */
    __IM uint32_t RESERVED10[9];
    __IOM uint32_t EVENTS_WRITE;                     /*!< (@ 0x0000013C) Write command received                                */
    __IOM uint32_t EVENTS_READ;                      /*!< (@ 0x00000140) Read command received                                 */
    __IM uint32_t RESERVED11[2];
    __IOM NRF_TWIS_EVENTS_DMA_Type EVENTS_DMA;       /*!< (@ 0x0000014C) Peripheral events.                                    */
    __IM uint32_t RESERVED12[4];
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED13[3];
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x00000194) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED14[9];
    __IOM uint32_t PUBLISH_WRITE;                    /*!< (@ 0x000001BC) Publish configuration for event WRITE                 */
    __IOM uint32_t PUBLISH_READ;                     /*!< (@ 0x000001C0) Publish configuration for event READ                  */
    __IM uint32_t RESERVED15[2];
    __IOM NRF_TWIS_PUBLISH_DMA_Type PUBLISH_DMA;     /*!< (@ 0x000001CC) Publish configuration for events                      */
    __IM uint32_t RESERVED16[3];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED17[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED18[113];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x000004D0) Error source                                          */
    __IM uint32_t MATCH;                             /*!< (@ 0x000004D4) Status register indicating which address had a match  */
    __IM uint32_t RESERVED19[10];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable TWIS                                           */
    __IM uint32_t RESERVED20[33];
    __IOM uint32_t ADDRESS[2];                       /*!< (@ 0x00000588) TWI slave address n                                   */
    __IM uint32_t RESERVED21;
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000594) Configuration register for the address match mechanism*/
    __IM uint32_t RESERVED22[10];
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Over-read character. Character sent out in case of an
                                                                         over-read of the transmit buffer.*/
    __IM uint32_t RESERVED23[15];
    __IOM NRF_TWIS_PSEL_Type PSEL;                   /*!< (@ 0x00000600) (unspecified)                                         */
    __IM uint32_t RESERVED24[62];
    __IOM NRF_TWIS_DMA_Type DMA;                     /*!< (@ 0x00000700) (unspecified)                                         */
  } NRF_TWIS_Type;                                   /*!< Size = 1884 (0x75C)                                                  */

/* TWIS_TASKS_STOP: Stop TWI transaction */
  #define TWIS_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop TWI transaction */
  #define TWIS_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define TWIS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TWIS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define TWIS_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TWIS_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TWIS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* TWIS_TASKS_SUSPEND: Suspend TWI transaction */
  #define TWIS_TASKS_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SUSPEND register.                             */

/* TASKS_SUSPEND @Bit 0 : Suspend TWI transaction */
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field.                                     */
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL) /*!< Min enumerator value of TASKS_SUSPEND field.                       */
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL) /*!< Max enumerator value of TASKS_SUSPEND field.                       */
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                   */


