NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* VPR_DEBUGIF_HARTINFO: Hart Information */
  #define VPR_DEBUGIF_HARTINFO_ResetValue (0x00000000UL) /*!< Reset value of HARTINFO register.                                */

/* DATAADDR @Bits 0..11 : Data Address */
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Pos (0UL)    /*!< Position of DATAADDR field.                                          */
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Msk (0xFFFUL << VPR_DEBUGIF_HARTINFO_DATAADDR_Pos) /*!< Bit mask of DATAADDR field.    */
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Min (0x800UL) /*!< Min value of DATAADDR field.                                        */
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Max (0x7FFUL) /*!< Max size of DATAADDR field.                                         */

/* DATASIZE @Bits 12..15 : Data Size */
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Pos (12UL)   /*!< Position of DATASIZE field.                                          */
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Msk (0xFUL << VPR_DEBUGIF_HARTINFO_DATASIZE_Pos) /*!< Bit mask of DATASIZE field.      */
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Min (0x0UL)  /*!< Min value of DATASIZE field.                                         */
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Max (0xCUL)  /*!< Max size of DATASIZE field.                                          */

/* DATAACCESS @Bit 16 : Data Access */
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Pos (16UL) /*!< Position of DATAACCESS field.                                        */
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Msk (0x1UL << VPR_DEBUGIF_HARTINFO_DATAACCESS_Pos) /*!< Bit mask of DATAACCESS field.*/
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Min (0x0UL) /*!< Min enumerator value of DATAACCESS field.                           */
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Max (0x1UL) /*!< Max enumerator value of DATAACCESS field.                           */
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_No (0x0UL) /*!< The data registers are shadowed in the hart by CSRs. Each CSR is DXLEN
                                                          bits in size, and corresponds to a single argument.*/
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Yes (0x1UL) /*!< The data registers are shadowed in the hart's memory map. Each
                                                           register takes up 4 bytes in the memory map.*/

/* NSCRATCH @Bits 20..23 : Number of dscratch registers */
  #define VPR_DEBUGIF_HARTINFO_NSCRATCH_Pos (20UL)   /*!< Position of NSCRATCH field.                                          */
  #define VPR_DEBUGIF_HARTINFO_NSCRATCH_Msk (0xFUL << VPR_DEBUGIF_HARTINFO_NSCRATCH_Pos) /*!< Bit mask of NSCRATCH field.      */


/* VPR_DEBUGIF_HALTSUM1: Halt Summary 1 */
  #define VPR_DEBUGIF_HALTSUM1_ResetValue (0x00000000UL) /*!< Reset value of HALTSUM1 register.                                */

/* HALTSUM1 @Bits 0..31 : Halt Summary 1 */
  #define VPR_DEBUGIF_HALTSUM1_HALTSUM1_Pos (0UL)    /*!< Position of HALTSUM1 field.                                          */
  #define VPR_DEBUGIF_HALTSUM1_HALTSUM1_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM1_HALTSUM1_Pos) /*!< Bit mask of HALTSUM1
                                                                            field.*/


/* VPR_DEBUGIF_HAWINDOWSEL: Hart Array Window Select */
  #define VPR_DEBUGIF_HAWINDOWSEL_ResetValue (0x00000000UL) /*!< Reset value of HAWINDOWSEL register.                          */

/* HAWINDOWSEL @Bits 0..14 : The high bits of this field may be tied to 0, depending on how large the array mask register is.
                             E.g. on a system with 48 harts only bit 0 of this field may actually be writable. */

  #define VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Pos (0UL) /*!< Position of HAWINDOWSEL field.                                    */
  #define VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Msk (0x7FFFUL << VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Pos) /*!< Bit mask of
                                                                            HAWINDOWSEL field.*/


/* VPR_DEBUGIF_HAWINDOW: Hart Array Window */
  #define VPR_DEBUGIF_HAWINDOW_ResetValue (0x00000000UL) /*!< Reset value of HAWINDOW register.                                */

/* MASKDATA @Bits 0..31 : Mask data. */
  #define VPR_DEBUGIF_HAWINDOW_MASKDATA_Pos (0UL)    /*!< Position of MASKDATA field.                                          */
  #define VPR_DEBUGIF_HAWINDOW_MASKDATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HAWINDOW_MASKDATA_Pos) /*!< Bit mask of MASKDATA
                                                                            field.*/


/* VPR_DEBUGIF_ABSTRACTCS: Abstract Control and Status */
  #define VPR_DEBUGIF_ABSTRACTCS_ResetValue (0x01000002UL) /*!< Reset value of ABSTRACTCS register.                            */

/* DATACOUNT @Bits 0..3 : Number of data registers that are implemented as part of the abstract command interface. Valid sizes
                          are 1..12. */

  #define VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Pos (0UL) /*!< Position of DATACOUNT field.                                         */
  #define VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Msk (0xFUL << VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Pos) /*!< Bit mask of DATACOUNT
                                                                            field.*/

/* CMDERR @Bits 8..10 : Command error when the abstract command fails. */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Pos (8UL)    /*!< Position of CMDERR field.                                            */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Msk (0x7UL << VPR_DEBUGIF_ABSTRACTCS_CMDERR_Pos) /*!< Bit mask of CMDERR field.        */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Min (0x0UL)  /*!< Min enumerator value of CMDERR field.                                */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Max (0x7UL)  /*!< Max enumerator value of CMDERR field.                                */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_NoError (0x0UL) /*!< No error.                                                         */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Busy (0x1UL) /*!< An abstract command was executing while command, abstractcs, or
                                                          abstractauto was written, or when one of the data or progbuf registers
                                                          was read or written. This status is only written if cmderr contains 0*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_NotSupported (0x2UL) /*!< The requested command is notsupported, regardless of whether
                                                                  the hart is running or not.*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Exception (0x3UL) /*!< An exception occurred while executing the command (e.g. while
                                                               executing theProgram Buffer).*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_HaltResume (0x4UL) /*!< The abstract command couldn't execute because the hart wasn't in
                                                                the required state (running/halted). or unavailable.*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Bus (0x5UL)  /*!< The abstract command failed due to abus error (e.g. alignment, access
                                                          size, or timeout).*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Other (0x7UL) /*!< The command failed for another reason.                              */

