NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* TRIGGERED19 @Bit 19 : Write '1' to enable interrupt for event TRIGGERED[19] */
  #define VPR_INTENSET_TRIGGERED19_Pos (19UL)        /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTENSET_TRIGGERED19_Msk (0x1UL << VPR_INTENSET_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.             */
  #define VPR_INTENSET_TRIGGERED19_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENSET_TRIGGERED19_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENSET_TRIGGERED19_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED19_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED19_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED20 @Bit 20 : Write '1' to enable interrupt for event TRIGGERED[20] */
  #define VPR_INTENSET_TRIGGERED20_Pos (20UL)        /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTENSET_TRIGGERED20_Msk (0x1UL << VPR_INTENSET_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.             */
  #define VPR_INTENSET_TRIGGERED20_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENSET_TRIGGERED20_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENSET_TRIGGERED20_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED20_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED20_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED21 @Bit 21 : Write '1' to enable interrupt for event TRIGGERED[21] */
  #define VPR_INTENSET_TRIGGERED21_Pos (21UL)        /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTENSET_TRIGGERED21_Msk (0x1UL << VPR_INTENSET_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.             */
  #define VPR_INTENSET_TRIGGERED21_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENSET_TRIGGERED21_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENSET_TRIGGERED21_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED21_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED21_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED22 @Bit 22 : Write '1' to enable interrupt for event TRIGGERED[22] */
  #define VPR_INTENSET_TRIGGERED22_Pos (22UL)        /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTENSET_TRIGGERED22_Msk (0x1UL << VPR_INTENSET_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.             */
  #define VPR_INTENSET_TRIGGERED22_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENSET_TRIGGERED22_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENSET_TRIGGERED22_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED22_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED22_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* VPR_INTENCLR: Disable interrupt */
  #define VPR_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* TRIGGERED16 @Bit 16 : Write '1' to disable interrupt for event TRIGGERED[16] */
  #define VPR_INTENCLR_TRIGGERED16_Pos (16UL)        /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTENCLR_TRIGGERED16_Msk (0x1UL << VPR_INTENCLR_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.             */
  #define VPR_INTENCLR_TRIGGERED16_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENCLR_TRIGGERED16_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENCLR_TRIGGERED16_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED16_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED16_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED17 @Bit 17 : Write '1' to disable interrupt for event TRIGGERED[17] */
  #define VPR_INTENCLR_TRIGGERED17_Pos (17UL)        /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTENCLR_TRIGGERED17_Msk (0x1UL << VPR_INTENCLR_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.             */
  #define VPR_INTENCLR_TRIGGERED17_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENCLR_TRIGGERED17_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENCLR_TRIGGERED17_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED17_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED17_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED18 @Bit 18 : Write '1' to disable interrupt for event TRIGGERED[18] */
  #define VPR_INTENCLR_TRIGGERED18_Pos (18UL)        /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTENCLR_TRIGGERED18_Msk (0x1UL << VPR_INTENCLR_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.             */
  #define VPR_INTENCLR_TRIGGERED18_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENCLR_TRIGGERED18_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENCLR_TRIGGERED18_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED18_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED18_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED19 @Bit 19 : Write '1' to disable interrupt for event TRIGGERED[19] */
  #define VPR_INTENCLR_TRIGGERED19_Pos (19UL)        /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTENCLR_TRIGGERED19_Msk (0x1UL << VPR_INTENCLR_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.             */
  #define VPR_INTENCLR_TRIGGERED19_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENCLR_TRIGGERED19_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTENCLR_TRIGGERED19_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED19_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED19_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED20 @Bit 20 : Write '1' to disable interrupt for event TRIGGERED[20] */
  #define VPR_INTENCLR_TRIGGERED20_Pos (20UL)        /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTENCLR_TRIGGERED20_Msk (0x1UL << VPR_INTENCLR_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.             */
  #define VPR_INTENCLR_TRIGGERED20_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENCLR_TRIGGERED20_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTENCLR_TRIGGERED20_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED20_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED20_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED21 @Bit 21 : Write '1' to disable interrupt for event TRIGGERED[21] */
  #define VPR_INTENCLR_TRIGGERED21_Pos (21UL)        /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTENCLR_TRIGGERED21_Msk (0x1UL << VPR_INTENCLR_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.             */
  #define VPR_INTENCLR_TRIGGERED21_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENCLR_TRIGGERED21_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTENCLR_TRIGGERED21_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED21_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED21_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED22 @Bit 22 : Write '1' to disable interrupt for event TRIGGERED[22] */
  #define VPR_INTENCLR_TRIGGERED22_Pos (22UL)        /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTENCLR_TRIGGERED22_Msk (0x1UL << VPR_INTENCLR_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.             */
  #define VPR_INTENCLR_TRIGGERED22_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENCLR_TRIGGERED22_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTENCLR_TRIGGERED22_Clear (0x1UL)     /*!< Disable                                                              */
  #define VPR_INTENCLR_TRIGGERED22_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENCLR_TRIGGERED22_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


