NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* VAL @Bits 0..31 : CLIC base address value */
  #define VPRCSR_MCLICBASE_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VPRCSR_MCLICBASE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCLICBASE_VAL_Pos) /*!< Bit mask of VAL field.                      */


/**
  * @brief TSELECT [VPRCSR_TSELECT] Trigger Select
  */
  #define VPRCSR_TSELECT (0x000007A0ul)
  #define VPRCSR_TSELECT_ResetValue (0x00000000UL)   /*!< Reset value of TSELECT register.                                     */

/* VAL @Bits 0..31 : Trigger Select value */
  #define VPRCSR_TSELECT_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define VPRCSR_TSELECT_VAL_Msk (0xFFFFFFFFUL << VPRCSR_TSELECT_VAL_Pos) /*!< Bit mask of VAL field.                          */


/**
  * @brief TDATA1 [VPRCSR_TDATA1] Trigger Data 1
  */
  #define VPRCSR_TDATA1 (0x000007A1ul)
  #define VPRCSR_TDATA1_ResetValue (0x00000000UL)    /*!< Reset value of TDATA1 register.                                      */

/* DATA @Bits 0..26 : Trigger Specific Data */
  #define VPRCSR_TDATA1_DATA_Pos (0UL)               /*!< Position of DATA field.                                              */
  #define VPRCSR_TDATA1_DATA_Msk (0x7FFFFFFUL << VPRCSR_TDATA1_DATA_Pos) /*!< Bit mask of DATA field.                          */

/* DMODE @Bit 27 : Debug Mode */
  #define VPRCSR_TDATA1_DMODE_Pos (27UL)             /*!< Position of DMODE field.                                             */
  #define VPRCSR_TDATA1_DMODE_Msk (0x1UL << VPRCSR_TDATA1_DMODE_Pos) /*!< Bit mask of DMODE field.                             */
  #define VPRCSR_TDATA1_DMODE_Min (0x0UL)            /*!< Min enumerator value of DMODE field.                                 */
  #define VPRCSR_TDATA1_DMODE_Max (0x1UL)            /*!< Max enumerator value of DMODE field.                                 */
  #define VPRCSR_TDATA1_DMODE_BOTH (0x0UL)           /*!< Both Debug and M-mode can write the tdata registers at the selected
                                                          tselect.*/
  #define VPRCSR_TDATA1_DMODE_ONLYDEBUG (0x1UL)      /*!< Only Debug Mode can write the tdata registers at the selected tselect.
                                                          Writes from other modes are ignored.*/

/* TYPE @Bits 28..31 : Type */
  #define VPRCSR_TDATA1_TYPE_Pos (28UL)              /*!< Position of TYPE field.                                              */
  #define VPRCSR_TDATA1_TYPE_Msk (0xFUL << VPRCSR_TDATA1_TYPE_Pos) /*!< Bit mask of TYPE field.                                */
  #define VPRCSR_TDATA1_TYPE_Min (0x0UL)             /*!< Min enumerator value of TYPE field.                                  */
  #define VPRCSR_TDATA1_TYPE_Max (0xFUL)             /*!< Max enumerator value of TYPE field.                                  */
  #define VPRCSR_TDATA1_TYPE_NOTRIGGER (0x0UL)       /*!< There is no trigger at this tselect                                  */
  #define VPRCSR_TDATA1_TYPE_MATCH (0x2UL)           /*!< The trigger is an address match trigger. The remaining bits in this
                                                          register act as described in mcontrol*/
  #define VPRCSR_TDATA1_TYPE_REMAP (0xFUL)           /*!< This trigger is a remapping trigger. The remaining bits in this
                                                          register behave as described in remapping functionality*/


/**
  * @brief TDATA2 [VPRCSR_TDATA2] Trigger Data 2
  */
  #define VPRCSR_TDATA2 (0x000007A2ul)
  #define VPRCSR_TDATA2_ResetValue (0x00000000UL)    /*!< Reset value of TDATA2 register.                                      */

/* DATA @Bits 0..31 : Trigger Specific Data */
  #define VPRCSR_TDATA2_DATA_Pos (0UL)               /*!< Position of DATA field.                                              */
  #define VPRCSR_TDATA2_DATA_Msk (0xFFFFFFFFUL << VPRCSR_TDATA2_DATA_Pos) /*!< Bit mask of DATA field.                         */


/**
  * @brief TDATA3 [VPRCSR_TDATA3] Trigger Data 3
  */
  #define VPRCSR_TDATA3 (0x000007A3ul)
  #define VPRCSR_TDATA3_ResetValue (0x00000000UL)    /*!< Reset value of TDATA3 register.                                      */

/* DATA @Bits 0..31 : Trigger Specific Data */
  #define VPRCSR_TDATA3_DATA_Pos (0UL)               /*!< Position of DATA field.                                              */
  #define VPRCSR_TDATA3_DATA_Msk (0xFFFFFFFFUL << VPRCSR_TDATA3_DATA_Pos) /*!< Bit mask of DATA field.                         */


/**
  * @brief TINFO [VPRCSR_TINFO] Trigger Info
  */
  #define VPRCSR_TINFO (0x000007A4ul)
  #define VPRCSR_TINFO_ResetValue (0x00000000UL)     /*!< Reset value of TINFO register.                                       */

/* INFO @Bits 0..15 : Trigger Info value */
  #define VPRCSR_TINFO_INFO_Pos (0UL)                /*!< Position of INFO field.                                              */
  #define VPRCSR_TINFO_INFO_Msk (0xFFFFUL << VPRCSR_TINFO_INFO_Pos) /*!< Bit mask of INFO field.                               */


/**
  * @brief TCONTROL [VPRCSR_TCONTROL] Trigger Control
  */
  #define VPRCSR_TCONTROL (0x000007A5ul)
  #define VPRCSR_TCONTROL_ResetValue (0x00000000UL)  /*!< Reset value of TCONTROL register.                                    */

/* MTE @Bit 3 : Mode Trigger Enable */
  #define VPRCSR_TCONTROL_MTE_Pos (3UL)              /*!< Position of MTE field.                                               */
  #define VPRCSR_TCONTROL_MTE_Msk (0x1UL << VPRCSR_TCONTROL_MTE_Pos) /*!< Bit mask of MTE field.                               */
  #define VPRCSR_TCONTROL_MTE_Min (0x0UL)            /*!< Min enumerator value of MTE field.                                   */
  #define VPRCSR_TCONTROL_MTE_Max (0x1UL)            /*!< Max enumerator value of MTE field.                                   */
  #define VPRCSR_TCONTROL_MTE_DONTMATCH (0x0UL)      /*!< Triggers with action=0 do not match/fire while the hart is in M-mode */
  #define VPRCSR_TCONTROL_MTE_MATCH (0x1UL)          /*!< Triggers do match/fire while the hart is in M-mode. When a trap into
                                                          M-mode is taken, mte is set to 0. When mret is executed, mte is set to
                                                          the value of mpte*/

/* MPTE @Bit 7 : Mode Previous Trigger Enable */
  #define VPRCSR_TCONTROL_MPTE_Pos (7UL)             /*!< Position of MPTE field.                                              */
  #define VPRCSR_TCONTROL_MPTE_Msk (0x1UL << VPRCSR_TCONTROL_MPTE_Pos) /*!< Bit mask of MPTE field.                            */


/**
  * @brief DCSR [VPRCSR_DCSR] Debug Control and Status
  */
  #define VPRCSR_DCSR (0x000007B0ul)
  #define VPRCSR_DCSR_ResetValue (0x40000003UL)      /*!< Reset value of DCSR register.                                        */

/* PRV @Bits 0..1 : Privilege level */
  #define VPRCSR_DCSR_PRV_Pos (0UL)                  /*!< Position of PRV field.                                               */
  #define VPRCSR_DCSR_PRV_Msk (0x3UL << VPRCSR_DCSR_PRV_Pos) /*!< Bit mask of PRV field.                                       */
  #define VPRCSR_DCSR_PRV_Min (0x3UL)                /*!< Min enumerator value of PRV field.                                   */
  #define VPRCSR_DCSR_PRV_Max (0x3UL)                /*!< Max enumerator value of PRV field.                                   */
  #define VPRCSR_DCSR_PRV_MACHINE (0x3UL)            /*!< (unspecified)                                                        */

