NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* CACHESIZE @Bits 0..3 : Cache size is 2^CACHESIZE or (1 << CACHESIZE) KB, with a maximum size of 32KB (CACHESIZE = 5) */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Pos (0UL) /*!< Position of CACHESIZE field.                                        */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Msk (0xFUL << VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Pos) /*!< Bit mask of CACHESIZE
                                                                            field.*/
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Min (0x0UL) /*!< Min value of CACHESIZE field.                                     */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHESIZE_Max (0xFUL) /*!< Max size of CACHESIZE field.                                      */

/* CACHELINESIZE @Bit 8 : Cache line size */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Pos (8UL) /*!< Position of CACHELINESIZE field.                                */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Msk (0x1UL << VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Pos) /*!< Bit mask of
                                                                            CACHELINESIZE field.*/
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Min (0x0UL) /*!< Min enumerator value of CACHELINESIZE field.                  */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_Max (0x1UL) /*!< Max enumerator value of CACHELINESIZE field.                  */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_CachelineSize32B (0x0UL) /*!< Cache line size is 32 bytes (4 data units)       */
  #define VPRCSR_NORDIC_CACHE_CFG_CACHELINESIZE_CachelineSize64B (0x1UL) /*!< Cache line size is 64 bytes (8 data units)       */


/**
  * @brief DATATAGADDR [VPRCSR_NORDIC_CACHE_DATATAGADDR] Cache tag base address
  */
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR (0x000007CAul)
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR_ResetValue (0x00000000UL) /*!< Reset value of DATATAGADDR register.                  */

/* VAL @Bits 0..31 : Cache tag base address value */
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR_VAL_Pos (0UL) /*!< Position of VAL field.                                            */
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CACHE_DATATAGADDR_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR_VAL_Min (0x00000000UL) /*!< Min value of VAL field.                                  */
  #define VPRCSR_NORDIC_CACHE_DATATAGADDR_VAL_Max (0xFFFFFFFCUL) /*!< Max size of VAL field.                                   */


/**
  * @brief DATABASEADDR [VPRCSR_NORDIC_CACHE_DATABASEADDR] Cache data base address
  */
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR (0x000007CBul)
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_ResetValue (0x00000000UL) /*!< Reset value of DATABASEADDR register.                */

/* VAL @Bits 0..31 : Cache data base address value */
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_VAL_Pos (0UL) /*!< Position of VAL field.                                           */
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CACHE_DATABASEADDR_VAL_Pos) /*!< Bit mask of
                                                                            VAL field.*/
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_VAL_Min (0x00000000UL) /*!< Min value of VAL field.                                 */
  #define VPRCSR_NORDIC_CACHE_DATABASEADDR_VAL_Max (0xFFFFFFFCUL) /*!< Max size of VAL field.                                  */


/**
  * @brief RTPERIPHCTRL [VPRCSR_NORDIC_RTPERIPHCTRL] RT peripheral control
  */
  #define VPRCSR_NORDIC_RTPERIPHCTRL (0x000007CCul)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_ResetValue (0x00000000UL) /*!< Reset value of RTPERIPHCTRL register.                      */

/* CLOCKPOLARITY @Bit 0 : Clock polarity */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Pos (0UL) /*!< Position of CLOCKPOLARITY field.                             */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Pos) /*!< Bit mask of
                                                                            CLOCKPOLARITY field.*/
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Min (0x0UL) /*!< Min enumerator value of CLOCKPOLARITY field.               */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Max (0x1UL) /*!< Max enumerator value of CLOCKPOLARITY field.               */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Low (0x0UL) /*!< Clock polarity is low                                      */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_High (0x1UL) /*!< Clock polarity is High                                    */

/* STOPCOUNTERS @Bit 4 : Stop counters CNT0 and CNT1 on OUTB under-run, or on INB Overflow if OUTMODE2 and INMODE2 */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Pos (4UL) /*!< Position of STOPCOUNTERS field.                               */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Pos) /*!< Bit mask of
                                                                            STOPCOUNTERS field.*/
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Min (0x0UL) /*!< Min enumerator value of STOPCOUNTERS field.                 */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Max (0x1UL) /*!< Max enumerator value of STOPCOUNTERS field.                 */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_NoStop (0x0UL) /*!< Counters do not stop on OUTB under-run                   */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Stop (0x1UL) /*!< Counters stop on OUTB under-run                            */

/* INSEL @Bit 8 : Input pin selection */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Pos (8UL) /*!< Position of INSEL field.                                             */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Pos) /*!< Bit mask of INSEL field.   */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Min (0x0UL) /*!< Min enumerator value of INSEL field.                               */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Max (0x1UL) /*!< Max enumerator value of INSEL field.                               */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_SamePin (0x0UL) /*!< Sample on same OUT pin                                         */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_SeparatePin (0x1UL) /*!< Sample on separate pin                                     */


/**
  * @brief CNTMODE0 [VPRCSR_NORDIC_CNTMODE0] CNT0 Mode
  */
  #define VPRCSR_NORDIC_CNTMODE0 (0x000007D0ul)
  #define VPRCSR_NORDIC_CNTMODE0_ResetValue (0x00000000UL) /*!< Reset value of CNTMODE0 register.                              */

/* CNTMODE0 @Bits 0..2 : CNT0 Mode */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Pos (0UL)  /*!< Position of CNTMODE0 field.                                          */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Msk (0x7UL << VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Pos) /*!< Bit mask of CNTMODE0 field.  */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Min (0x0UL) /*!< Min enumerator value of CNTMODE0 field.                             */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Max (0x3UL) /*!< Max enumerator value of CNTMODE0 field.                             */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_STOP (0x0UL) /*!< CNT0 stops at 0                                                    */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_WRAP (0x1UL) /*!< When CNT0 reaches 0 it will continue counting from 0xFFFF          */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_RELOAD (0x2UL) /*!< When CNT0 reaches 0 it will continue counting from the value in
                                                              CNTTOP*/
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_TRIGCOMB (0x3UL) /*!< When CNT0 reaches 0 it is reloaded from CNTTOP and stops.
                                                                Counting will restart when a VIO event happens*/


/**
  * @brief CNTMODE1 [VPRCSR_NORDIC_CNTMODE1] CNT1 Mode
  */
  #define VPRCSR_NORDIC_CNTMODE1 (0x000007D1ul)
  #define VPRCSR_NORDIC_CNTMODE1_ResetValue (0x00000000UL) /*!< Reset value of CNTMODE1 register.                              */

/* CNTMODE1 @Bits 0..2 : CNT1 Mode */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Pos (0UL)  /*!< Position of CNTMODE1 field.                                          */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Msk (0x7UL << VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Pos) /*!< Bit mask of CNTMODE1 field.  */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Min (0x0UL) /*!< Min enumerator value of CNTMODE1 field.                             */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Max (0x3UL) /*!< Max enumerator value of CNTMODE1 field.                             */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_STOP (0x0UL) /*!< CNT1 stops at 0                                                    */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_WRAP (0x1UL) /*!< When CNT1 reaches 0 it will continue counting from 0xFFFF          */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_RELOAD (0x2UL) /*!< When CNT1 reches 0 it will continue counting from the value in
                                                              CNTTOP*/
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_TRIGCOMB (0x3UL) /*!< In combine mode mode CNT1 acts as an extension of CNT0 (16 most
                                                                significant bits of the 32-bit CNT)*/


/**
  * @brief CNT [VPRCSR_NORDIC_CNT] 32-bit Counter
  */
  #define VPRCSR_NORDIC_CNT (0x000007D2ul)
  #define VPRCSR_NORDIC_CNT_ResetValue (0x00000000UL) /*!< Reset value of CNT register.                                        */

/* CNT0 @Bits 0..15 : 16-bit Counter 0 */
  #define VPRCSR_NORDIC_CNT_CNT0_Pos (0UL)           /*!< Position of CNT0 field.                                              */
  #define VPRCSR_NORDIC_CNT_CNT0_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT_CNT0_Pos) /*!< Bit mask of CNT0 field.                     */

/* CNT1 @Bits 16..31 : 16-bit Counter 1 */
  #define VPRCSR_NORDIC_CNT_CNT1_Pos (16UL)          /*!< Position of CNT1 field.                                              */
  #define VPRCSR_NORDIC_CNT_CNT1_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT_CNT1_Pos) /*!< Bit mask of CNT1 field.                     */


/**
  * @brief CNTTOP [VPRCSR_NORDIC_CNTTOP] Counter Top
  */
  #define VPRCSR_NORDIC_CNTTOP (0x000007D3ul)
  #define VPRCSR_NORDIC_CNTTOP_ResetValue (0x00000000UL) /*!< Reset value of CNTTOP register.                                  */

