NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l10_types.h
/* PUBLISH18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos (18UL) /*!< Position of PUBLISH18 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos) /*!< Bit mask of PUBLISH18 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Min (0x0UL) /*!< Min enumerator value of PUBLISH18 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Max (0x1UL) /*!< Max enumerator value of PUBLISH18 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Disabled (0x0UL) /*!< Publish disabled for EVENTS[18]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Enabled (0x1UL) /*!< Publish enabled for EVENTS[18]                                  */

/* PUBLISH19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos (19UL) /*!< Position of PUBLISH19 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos) /*!< Bit mask of PUBLISH19 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Min (0x0UL) /*!< Min enumerator value of PUBLISH19 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Max (0x1UL) /*!< Max enumerator value of PUBLISH19 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Disabled (0x0UL) /*!< Publish disabled for EVENTS[19]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Enabled (0x1UL) /*!< Publish enabled for EVENTS[19]                                  */


/**
  * @brief INTEN [VPRCSR_NORDIC_INTEN] DPPI Event Interrupt Enable
  */
  #define VPRCSR_NORDIC_INTEN (0x000007E4ul)
  #define VPRCSR_NORDIC_INTEN_ResetValue (0x00000000UL) /*!< Reset value of INTEN register.                                    */

/* INTEN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Pos (0UL)       /*!< Position of INTEN0 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN0_Pos) /*!< Bit mask of INTEN0 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Min (0x0UL)     /*!< Min enumerator value of INTEN0 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Max (0x1UL)     /*!< Max enumerator value of INTEN0 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[0]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[0]                                      */

/* INTEN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Pos (1UL)       /*!< Position of INTEN1 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN1_Pos) /*!< Bit mask of INTEN1 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Min (0x0UL)     /*!< Min enumerator value of INTEN1 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Max (0x1UL)     /*!< Max enumerator value of INTEN1 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[1]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[1]                                      */

/* INTEN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Pos (2UL)       /*!< Position of INTEN2 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN2_Pos) /*!< Bit mask of INTEN2 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Min (0x0UL)     /*!< Min enumerator value of INTEN2 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Max (0x1UL)     /*!< Max enumerator value of INTEN2 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[2]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[2]                                      */

/* INTEN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Pos (3UL)       /*!< Position of INTEN3 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN3_Pos) /*!< Bit mask of INTEN3 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Min (0x0UL)     /*!< Min enumerator value of INTEN3 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Max (0x1UL)     /*!< Max enumerator value of INTEN3 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[3]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[3]                                      */

/* INTEN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Pos (4UL)       /*!< Position of INTEN4 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN4_Pos) /*!< Bit mask of INTEN4 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Min (0x0UL)     /*!< Min enumerator value of INTEN4 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Max (0x1UL)     /*!< Max enumerator value of INTEN4 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[4]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[4]                                      */

/* INTEN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Pos (5UL)       /*!< Position of INTEN5 field.                                            */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN5_Pos) /*!< Bit mask of INTEN5 field.              */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Min (0x0UL)     /*!< Min enumerator value of INTEN5 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Max (0x1UL)     /*!< Max enumerator value of INTEN5 field.                                */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[5]                                    */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[5]                                      */

